// 과일가게

// 1. 2개의 객체를 만드세요 1)사람 2)과일가게
// 2. 사람 = { 이름, 돈, 함수들은 개인의 자유}
// 3. 과일가게 = { 판매중인 과일, 과일가격, 수량, 매출, 함수자유 }
// 4. 사람이 과일을산다 -> 사람의 돈이 과일 가격만큼 빠진다 (예외처리 자유)
//    -> console( ex. name님이 사과를 구매했습니다.)
//    -> console( ex. name님의 돈이 400원 남았습니다.)
//    -> console( ex. 과일가게의 매상이 2000원 증가했습니다. 총 매출 : 2000원)
//    -> console( ex. 남의 과일의 수 4개)




// 고양이 관리 
// 1 . 고양이 객체 만들기 
// 2 . 고양이 이름 만들어주기 -> 이름출력
// 3 . 고양이 나이 추가 -> 나이출력
// 4 . 고양이 상태 추가 ( default : 배고파요 )
// 5 . 고양이 상태 출력함수실행 3초후에 ( 고양이이름 + 고양이상태 ) ex. 빵야가 배고파요를 출력
// 6 . 고양이 밥주기 
// 7 . 다시 고양이 상태출력 (배불러여 ~)
// 8 . 고양이 산책시키기 -> 상태 배고파요 -> 밥주기 
